## 📋 Plan Result (keeping)

### 🔄 Execution Steps

| Step | Status |
|------|--------|
| 🎨 **Format Check** | ✅ Passed |
| ✅ **Validation** | ✅ Passed |
| 🚀 **Init** | ✅ Passed |
| 📋 **Plan** | 🔄 Changes Detected |

⚠️ **Infrastructure changes with warnings**

The plan was generated successfully but contains warnings that should be reviewed.

```
Plan: 38 to add, 0 to change, 0 to destroy.
```

### ⚠️ Warnings

- **Python 3.9 Runtime**: Lambda packaging encountered Python version issues
- This warning does not prevent infrastructure deployment
- Consider ensuring Python 3.9 is available for optimal Lambda packaging

### 📊 Resource Summary

| Type | Count |
|------|-------|
| ➕ **To Add** | 38 |
| 🔄 **To Change** | 0 |
| ❌ **To Destroy** | 0 |

<details><summary>🔄 Change Result (Click me)</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.custom_slash_command.module.dispatch_backup_function.data.external.archive_prepare[0]: Reading...
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Reading...
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Reading...
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
module.custom_slash_command.module.dispatch_backup_function.data.aws_region.current: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_partition.current: Reading...
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_caller_identity.current: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_slash_command.module.dispatch_backup_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Read complete after 0s [id=3154560550]
module.custom_slash_command.module.dispatch_backup_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.custom_slash_command.module.dispatch_backup_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
<= read (data resources)
Terraform planned the following actions, but then encountered a problem:
# null_resource.name will be created
+ resource "null_resource" "name" {
+ id = (known after apply)
}
# module.custom_chatbot.aws_chatbot_slack_channel_configuration.chatbot_slack_configuration will be created
+ resource "aws_chatbot_slack_channel_configuration" "chatbot_slack_configuration" {
+ chat_configuration_arn      = (known after apply)
+ configuration_name          = "minecraft-test-chatbot"
+ guardrail_policy_arns       = [
+ "arn:aws:iam::aws:policy/ReadOnlyAccess",
]
+ iam_role_arn                = (known after apply)
+ logging_level               = "NONE"
+ region                      = "ap-northeast-1"
+ slack_channel_id            = (sensitive value)
+ slack_channel_name          = (known after apply)
+ slack_team_id               = (sensitive value)
+ slack_team_name             = (known after apply)
+ sns_topic_arns              = [
+ (known after apply),
]
+ tags                        = {
+ "environment" = "test"
+ "owners"      = "minecraft"
}
+ tags_all                    = {
+ "environment" = "test"
+ "owners"      = "minecraft"
}
+ user_authorization_required = false
}
# module.custom_iam.aws_iam_policy.chatbot-notification-only will be created
+ resource "aws_iam_policy" "chatbot-notification-only" {
+ arn              = (known after apply)
+ attachment_count = (known after apply)
+ id               = (known after apply)
+ name             = "chatbot-notification-only"
+ name_prefix      = (known after apply)
+ path             = "/"
+ policy           = jsonencode(
{
+ Statement = [
+ {
+ Action   = [
+ "logs:DescribeQueryDefinitions",
+ "logs:DescribeLogGroups",
]
+ Effect   = "Allow"
+ Resource = "*"
+ Sid      = ""
},
]
+ Version   = "2012-10-17"
}
)
+ policy_id        = (known after apply)
+ tags_all         = (known after apply)
}
# module.custom_iam.aws_iam_role.chatbot-notification-only will be created
+ resource "aws_iam_role" "chatbot-notification-only" {
+ arn                   = (

... (content truncated due to length) ...

YCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 1624, in prepare_command
│     build_plan = bpm.plan(source_path, query)
│                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^
│   File "./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 831, in plan
│     pip_requirements_step(
│   File "./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 700, in pip_requirements_step
│     raise RuntimeError(
│ RuntimeError: Python interpreter version equal to defined lambda runtime
│ (python3.9) should be available in system PATH
│
│ State: exit status 1
╵

exit status 1
ERROR: terraform invocation failed in ./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping stderr=
╷
│ Error: External Program Execution Failed
│
│   with module.custom_slash_command.module.dispatch_backup_function.data.external.archive_prepare[0],
│   on .terraform/modules/custom_slash_command.dispatch_backup_function/package.tf line 10, in data "external" "archive_prepare":
│   10:   program = [local.python, "${path.module}/package.py", "prepare"]
│
│ The data source received an unexpected error while attempting to execute
│ the program.
│
│ Program: /usr/bin/python3
│ Error Message: Traceback (most recent call last):
│   File "./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 1861, in <module>
│     main()
│   File "./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 1857, in main
│     exit(args.command(args))
│          ^^^^^^^^^^^^^^^^^^
│   File "./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 1624, in prepare_command
│     build_plan = bpm.plan(source_path, query)
│                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^
│   File "./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 831, in plan
│     pip_requirements_step(
│   File "./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping/.terraform/modules/custom_slash_command.dispatch_backup_function/package.py", line 700, in pip_requirements_step
│     raise RuntimeError(
│ RuntimeError: Python interpreter version equal to defined lambda runtime
│ (python3.9) should be available in system PATH
│
│ State: exit status 1
╵

ERROR: 1 error occurred:
	* [./.terragrunt-cache/20KJ7otrUGIQotZ67wF12i_wjbg/_4MtXHYCWA2GAoCPiNJgp6-wA8E/keeping] exit status 1```

</details>

### 🔗 Links

- 📊 **[View GitHub Actions Run](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16861201112)**
- 📦 **[Download Artifacts](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16861201112#artifacts)**
- 🔍 **[View Terragrunt Plan Job](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16861201112/job/comment-results)**

*📋 Plan executed at 2025-08-10T12:10:21.779Z | Environment: keeping*